const questions = [
  "Ти віддаєш перевагу глибоким розмовам пізно вночі чи легким бесідам вранці?",
  "Тобі подобається проводити час наодинці?",
  "Ти віриш у мови кохання? Якщо так, то яка з них твоя?",
  "Чого ти найбільше боїшся?",
  "Який момент з нашим знайомством пам'ятаєш найбільше?",
  "Як ти справляєшся, коли відчуваєш себе перевантаженим?",
  "В якому вигляді тобі найбільше подобається отримувати підтримку",
  "Як ти уявляєш своє життя через 5 років?",
  "Що для тебе зрада?",
  "Як ти справляєшся із стресом або несподіваними викликами",
  "Чи бачиш ти себе з дітьми у майбутньому",
  "Буває таке, що ти з партнером/кою проводите разом занадто багато часу, тобі хочеться побути наодинці, але не кажеш йому/їй про це , бо боїшся образити?",
  "Тобі подобаються прояви ніжності на людях?",
  "Ти пам'ятаєш, що перше привернуло увагу  до партнера/ки?",
  "Які подарунки тобі подобається отримувати?",
  "Як ти ставишся до обміну паролями чи пристроями",
  "Чи даси ти телефон другій половинці, якщо вона попросить, щоб перевірити з ким ти листуєшся",
  "Уяви, що ми у шлюбі, як ти бачиш наш бюджет",
  "Що для тебе означає вірність у стосунках? Чи вважаєш  ти це важливим?",
  "Які у тебе стосунки із колишніми?",
  "Які три цінності ти вважаєш найважливішими в людині?",
  "Чи є щось, що ти хочеш мені сказати, але боїшся?",
  "В які моменти ти відчуваєш себе менш коханим/коханою",
  "Назви 5 речей, за які на твою думку тебе любить твоя половинка",
  "Назви 3 речі, які, на твою думку, дратують твого парнера в тобі",
  "Розкажи детально, як ти зрозумів/ла, що тобі подобається твоя половинка",
  "Коли ти зрозумів/ла, що любиш партнера/ку?",
  "Розкажи, як і коли ти зрозумів, що хочеш будувати стосунки із твоїм нинішнім партнером/кою",
  "Які були причини, чому закінсилися твої останні 2 романтичні стосунки?",
  "Чи важливо для тебе створення сім'ї?",
  "Якби ти був протилежної статті на годину, щоб хотів спробувати?",
  "Наскільки для тебе важлива фізична близкість у стосунках?",
  "Яка твоя думка про присутність соціальних мереж у стосунках? Чи є щось, що тебе не влаштовує у соціальних сторінках партнера/ки",
  "Ти віддаєш перевагу особистим розмовам чи текстовим повідомленням для серйозних тем?",
  "Чи приховував ти щось від партнера/ки, бо боявся, як я можу відреагувати?",
  "Як найкраще твоя половинка може тебе підтримати, коли ти почуваєшся не дуже?",
  "Наскільки тобі комфортно ділитися своїми справжніми переживаннями за шкалою від 1 до 10",
  "Чи довіряєш ти своїм близьким, чи вважаєш, що єдина людина, на яку ти можеш покластися - це ти сам? Чи важливо для тебе покладатися на партнера/ку чи краще все ж на себе? І як ти вважаєш, чи можеш покладатися на партнера/ку?",
  "Які дрібні дії парнера/ки змушують тебе посміхнутися?",
  "Що тобі підіймає настрій?",
  "Чи  є якісь теми, які тобі важко обговорювати зі мною? Чому?",
  "Чи є у тебе проблеми із бюджетом? Наприклад, ти в боргу у когось? Чи робиш ти якісь непотрібні витрати?",
  "Опиши своє ідеальне побачення",
  "Чи були ситуації, коли ти відчував ревнощі щодо другої половинки? якщо так, то коли?",
  "Як ти бачиш розвиток наших стосунків із часом?",
  "Чи є/були в тебе серйозні психологічні проблеми?",
  "Як ти ставишся до того, щоб жити разом у майбутньому?",
  "Як ти почуваєшся щодо нашого поточного рівня близкості і що ми можемо зробити, щоб його покращити?",
  "Чи є якісь звички або поведінка партнера/ки, які тебе дратують?",
  "Як би ти міг/могла змінити одну річ в мені, щоб це було? ",
  "Які твої найбільші страхи щодо стосунків?",
  "Як ти ставишся сюрпризів?",
  "Поділися найдорожчим спільним спогадом",
  "Чи був колись секс у публічному місці? Чи хотіли б спобувати?",
  "Чи було таке, що ти цілував/цілувала більше ніж одну людину протягом 24 годин?",
  "Чи часто фантазуєш про свого хлопця/дівчину, коли його/її немає поруч",
  "Щоб ти хотів додати/змінити/спробувати у нашому інтимі?",
  "Як ти втратив/втратила свою невинність?",
  "Чи є в тебе секс-іграшки, як до них ставишся?",
  "Ти віддаєш перевагу переглядати професійне чи аматорське порно?",
  "Який улюблений жанр порно?",
  "Тобі легко сказати все, що ти хочеш під час сексу?",
  "Як ти почуваєшся щодо нашого стилю спілкування?",
  "Що ти ніколи не пробачиш?",
  "Чи є щось, що ти хотів/ла б, щоб ми робили більше або менше у наших стосунках?",
  "Яку традицію ти б хотів/ла б, щоб ми започаткували, як пара?",
  "Що б ти хотів/ла відчувати більше у наших стосунках?",
  "Що тобі найбільше подобається у наших стосунках?",
  "Яку б одну річ, ти б хотів покращити у наших стосунках?",
  "На питання: букет вашій дівчині чи мамі?, якою б була твоя відповідь?",
  "Тобі більше подобається дарувати чи отримувати?",
  "Чи є якісь невирішені почуття або ситуації із твого минулого, про які ти вагаєшся говорити, але вважаєш, що варто?",
  "Як ти ставишся до спроби нових активностей разом?",
  "Якщо б ми створили список бажань для пар, яке б ти додав/ла першим?",
  "Як ти хотів/ла б відзначити нашу річницю?",
  "Чи важливі для тебе свята? Яке найбльш улюблене?",
  "Як ти ставишся до несподіваних романтичних жестів?",
  "Як ти ставишся до відкритого обговорення наших сексуальних меж?",
  "Тобі потрібна фінансова допомога парнера/ки зараз? Якщо їй/йому знадобиться допомога, чи буде тобі комфортно допомогти?",
  "Як ти ставишся до несподіваних побачень?",
  "Яка твоя мрія про пропозицію?",
  "Розкажи, які були твої думки під час першої зустрічі зі мною",
];

let shuffledQuestions = questions.sort(() => Math.random() - 0.5);
let index = 0;

const questionElement = document.getElementById("question");
const nextBtn = document.getElementById("nextBtn");

function showQuestion() {
  if (index < shuffledQuestions.length) {
    questionElement.textContent = shuffledQuestions[index];
    index++;
  } else {
    questionElement.textContent = "Питання закінчилися 💕";
    nextBtn.style.display = "none";
  }
}

nextBtn.addEventListener("click", showQuestion);

showQuestion();
